IDEA Open Model
Segment3D.EndPoint Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the reference to Point3D endpoint of the segment.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public ReferenceElement EndPoint { get; set; }
Public Property EndPoint As ReferenceElement
	Get
	Set
Property Value
Type: ReferenceElement
See Also
Reference
Segment3D Class
IdeaRS.OpenModel.Geometry3D Namespace